cases/BrownianVerification/0.org/T.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.air;
}

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
    empties
    {
        type            empty;
    }
}
