cases/BrownianVerification/constant/flotationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      flotationParticleProperties;
}

rho                 1E4;
Sct                 1.0;

continuousPhaseName water;
dispersedPhaseName  air;

sectionalDistribution
{
    type        sectionalList;
    diameters   (1e-9 2e-9 4e-9 8e-9 1.6e-8 3.2e-8 6.4e-8 1.28e-7 2.56e-7 5.12e-7 1.024e-6 2.048e-6);
}

particleVelocityModel
{
    type        passiveTracer;
}

BrownianDiffusivityModel
{
    type        StokesEinstein;
}

efficiencyModels
{
    collisions
    {
        type    ideal;
    }
    attachment
    {
        type    ideal;

        inductionTime
        {
            type    none;
        }
    }
    stabilization
    {
        type    ideal;
    }
}

interactionModels
{
    attachment
    {
        deterministic
        {
            type    none;
        }
        stochastic
        {
            type    none;
        }
        Brownian
        {
            type    infiniteSink;

            SherwoodCorrelation
            {
                type    RanzMarshall;
            }
        }
    }
    detachment
    {
        stochastic
        {
            type    none;
        }
    }
}
