cases/BrownianVerification/constant/phaseProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}

type basicMultiphaseSystem;

phases (air water);

air
{
    type            pureIsothermalPhaseModel;

    diameterModel   threeMomentLogNormal;

    threeMomentLogNormalCoeffs
    {
        dMax            1e-1;
        dMin            1e-6;

        p               3;
        q               2;

        continuousPhase water;

        closingMoment   interfacialArea;

        coalescence
        {
            active  false;
        }

        breakup
        {
            active  false;
        }
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type    continuous;
        phase   water;
    }
}

surfaceTension
(
    (air and water)
    {
        type    constant;
        sigma   0.07;
    }
);

aspectRatio
(
    (air in water)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (air in water)
    {
        type            TomiyamaCorrelated;

        A               24.0;

        residualRe      1e-3;
        residualEo      1e-6;

        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (air in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
()

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
    (air in water)
    {
        type                Burns;
        sigma               0.7;
        Ctd                 1.0;
        residualAlpha       1e-3;
    }
);

phaseTransfer
();
