cases/BrownianVerification/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     multiphaseEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         7200;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   360;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

libs
(
    // From the LogMoM repository
    "libLogMoM.so"

    // From the flotationFoam repository
    "libflotation.so"
);

functions
{
    Ncs
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        writeControl    timeStep;

        log             no;
        writeFields     no;

        operation       volIntegrate;

        fields
        (
            #include "Ncs"
        );
    }

    Nfs
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        writeControl    timeStep;

        log             no;
        writeFields     no;

        operation       volIntegrate;

        fields
        (
            #include "Nfs"
        );
    }
}

