cases/BrownianVerification/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 4;

method simple;

simpleCoeffs
{
    n               (1 4 1);
    delta           0.001;
}
