cases/BrownianVerification/system/graph
graph
{
    start   (0.05 0 0.05);
    end     (0.05 1 0.05);

    fields  (Nc.1 Nf.1);

    #includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

    writeControl    adjustableRunTimea;

    setConfig
    {
        nPoints     1000;
    }

    #includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
